export const ERROR_MESSAGES = {
  EMAIL_REQUIRED: "Почта обязательна для заполнения",
  EMAIL_INVALID: "Неверный формат почты",
  USERNAME_REQUIRED: "Имя пользователя обязательно для заполнения",
  USERNAME_INVALID:
    "Имя пользователя должно быть от 3 до 25 символов, начинаться с буквы, заканчиваться буквой или цифрой и содержать только латинские буквы, цифры и нижнее подчеркивание",
  PASSWORD_REQUIRED: "Пароль обязательно для заполнения",
  PASSWORD_INVALID:
    "Пароль должен содержать минимум 8 символов, одну заглавную букву, одну строчную букву, одну цифру и один специальный символ",
  PASSWORD_TWO_REQUIRED: "Повторите пароль",
  PASSWORDS_MISMATCH: "Пароли не совпадают",
};
